{
  "exercises": [
    {
      "name": "Barbell Squat",
      "muscleGroups": ["Quadriceps", "Glutes", "Hamstrings", "Core"],
      "science": "Compound movement activating 200+ muscles. Studies show squats increase testosterone and growth hormone by 25%. Depth to parallel or below maximizes glute activation.",
      "form": "Feet shoulder-width, bar on upper traps, descend until thighs parallel to ground, drive through heels",
      "sets": "3-5",
      "reps": "6-12",
      "restSeconds": 180
    },
    {
      "name": "Deadlift",
      "muscleGroups": ["Posterior Chain", "Back", "Glutes", "Hamstrings"],
      "science": "Highest muscle recruitment of any exercise. Research shows deadlifts improve bone density and functional strength. Engages 70% of skeletal muscle.",
      "form": "Hip-width stance, grip outside legs, neutral spine, drive hips forward",
      "sets": "3-5",
      "reps": "5-8",
      "restSeconds": 240
    },
    {
      "name": "Bench Press",
      "muscleGroups": ["Chest", "Triceps", "Anterior Deltoids"],
      "science": "Primary chest builder. EMG studies show 30-45 degree decline maximizes pec activation. Progressive overload increases strength 5-10% monthly.",
      "form": "Retract scapula, arch lower back slightly, lower to mid-chest, press explosively",
      "sets": "3-4",
      "reps": "8-12",
      "restSeconds": 120
    }
  ],
  "nutrition": {
    "protein": {
      "dailyGrams": "1.6-2.2g per kg bodyweight",
      "science": "Meta-analysis of 49 studies confirms 1.6g/kg optimizes muscle protein synthesis. Higher intake (2.2g/kg) beneficial during caloric deficit.",
      "sources": ["Chicken breast", "Salmon", "Greek yogurt", "Eggs", "Whey protein"]
    },
    "carbohydrates": {
      "dailyGrams": "3-7g per kg bodyweight",
      "science": "Glycogen stores fuel high-intensity training. Research shows 5-7g/kg maximizes performance and recovery for athletes.",
      "sources": ["Oats", "Sweet potato", "Rice", "Quinoa", "Fruits"]
    },
    "fats": {
      "dailyGrams": "0.5-1.5g per kg bodyweight",
      "science": "Essential for hormone production. Studies show omega-3s reduce inflammation and improve recovery. Minimum 0.5g/kg for hormonal health.",
      "sources": ["Avocado", "Nuts", "Olive oil", "Fatty fish", "Seeds"]
    }
  },
  "recovery": {
    "sleep": {
      "hours": "7-9",
      "science": "Sleep deprivation reduces muscle protein synthesis by 18%. Growth hormone peaks during deep sleep. Studies show 8+ hours optimal for athletes."
    },
    "hydration": {
      "liters": "3-4",
      "science": "2% dehydration reduces performance by 10-20%. Electrolyte balance critical for muscle contraction and recovery."
    },
    "restDays": {
      "perWeek": "1-2",
      "science": "Muscle growth occurs during rest. Research shows 48-72 hours needed for full muscle recovery. Overtraining increases cortisol and injury risk."
    }
  },
  "citations": [
    "Morton RW, et al. A systematic review, meta-analysis and meta-regression of the effect of protein supplementation on resistance training-induced gains in muscle mass and strength in healthy adults. Br J Sports Med. 2018;52(6):376-384.",
    "Schoenfeld BJ, et al. How much protein can the body use in a single meal for muscle-building? Implications for daily protein distribution. J Int Soc Sports Nutr. 2018;15:10.",
    "Kraemer WJ, Ratamess NA. Hormonal responses and adaptations to resistance exercise and training. Sports Med. 2005;35(4):339-361.",
    "Dattilo M, et al. Sleep and muscle recovery: Endocrinological and molecular basis for a new and promising hypothesis. Med Hypotheses. 2011;77(2):220-222."
  ]
}
